In [ ]:
drop TABLE if EXISTS team;

CREATE TABLE team (
        name VARCHAR(50),
        rank int
)

In [ ]:
INSERT into team values ('alpha' , 1) , ('date' , 2) , ('gamma' ,3) ,('delta' , 4);

In [ ]:
SELECT * FROM team

In [ ]:
SELECT t1.name team1 , t2.name team2 FROM team t1 , team t2
    where t1.name > t2.name

In [ ]:
SELECT concat(t1.name,'(' , t1.rank , ')' ) team1 , concat(t2.name , '(' , t2.rank , ')') team2 FROM team t1 , team t2
    where t1.name != t2.name